Goodwu/USBino/avr/boards.txt
menu.cpu=Processor

##############################################################

usbino.name=USBino

usbino.upload.tool=arduino:avrdude
usbino.upload.protocol=usbasp

usbino.bootloader.tool=arduino:avrdude
usbino.bootloader.low_fuses=0xFF
usbino.bootloader.high_fuses=0xDE
usbino.bootloader.extended_fuses=0xFD
usbino.bootloader.unlock_bits=0x3F
usbino.bootloader.lock_bits=0x0F

usbino.build.board=AVR_USBINO
usbino.build.core=arduino:arduino
usbino.build.variant=usbino

###### ATmega328p

## USBino W/ ATmega328p (16MHz)
usbino.menu.cpu.atmega328p=ATmega328p (16 MHz)

usbino.menu.cpu.atmega328p.upload.maximum_size=28672
usbino.menu.cpu.atmega328p.upload.maximum_data_size=2048
usbino.menu.cpu.atmega328p.upload.speed=115200

usbino.menu.cpu.atmega328p.bootloader.file=usbasploader/usbasploader_atmega328p.hex

usbino.menu.cpu.atmega328p.build.mcu=atmega328p
usbino.menu.cpu.atmega328p.build.f_cpu=16000000L
usbino.menu.cpu.atmega328p.build.board=AVR_UNO_VUSB
usbino.menu.cpu.atmega328p.build.variant=standard

###### ATmega32x

## USBino W/ ATmega32 (16MHz)
usbino.menu.cpu.atmega32=ATmega32 (16 MHz)

usbino.menu.cpu.atmega32.upload.maximum_size=28672
usbino.menu.cpu.atmega32.upload.maximum_data_size=2048
usbino.menu.cpu.atmega32.upload.speed=115200

usbino.menu.cpu.atmega32.bootloader.file=usbasploader/usbasploader_atmega32.hex

usbino.menu.cpu.atmega32.build.mcu=atmega32
usbino.menu.cpu.atmega32.build.f_cpu=16000000L

###### ATmega16x

## USBino W/ ATmega16 (16MHz)
usbino.menu.cpu.atmega16=ATmega16 (16 MHz)

usbino.menu.cpu.atmega16.upload.maximum_size=28672
usbino.menu.cpu.atmega16.upload.maximum_data_size=2048
usbino.menu.cpu.atmega16.upload.speed=115200

usbino.menu.cpu.atmega16.bootloader.file=usbasploader/usbasploader_atmega16.hex

usbino.menu.cpu.atmega16.build.mcu=atmega16
usbino.menu.cpu.atmega16.build.f_cpu=16000000L

############################################################
